// ניתובים: דף הבית, התחברות (אם הלקוח לא קיים נעביר להרשמה או שנכתוב אין לך חשבון? – לינק להרשמה), כל הטיולים
// על הנב נציג את שם המשתמש אחרי התחברות / הרשמה
// דף הבית 
// הרשמה – טופס
// התחברות – טופס, ניתוב פנימי להרשמה
// כל הטיולים: שליפה משרת של כל הטיולים ושמירה גם במשתנה סטייט וגם ברידקס
// באמצעות קופוננטה שמציגה כרטיס טיול
// פרטים נוספים – מקבלת בניתוב קוד טיול ושולפת מהרידקס לפי קוד
import './styleMy.css';
export const Home =()=>{
    return<>
    <h1>ברוכים הבאים וברוכות הבאות לאתר הטיולים שלנו</h1>
    <h2>אני מקווה שתיהנו מהאתר ותיצאו להרפתקאות מסביב לעולם</h2>
    <h3>מאת: אתר הטיולים שלי</h3>
    <h3>סיוון דיין</h3>
    </>
}
