import React from "react";
import { Div } from "./Div";
// קומפוננטה היא פונקציה
// HTML ניתן שם באות גדולה - להבדיל מתגיות של 
export function Hello() {
    // קומפוננטה מחזירה HTML + JS
    return (
        // פונקציה יכולה להחזיר רק אובייקט אחד
        // דרכים להחזיר כמה אובייקטים:

        // 1. לעטוף את כל האובייקטים בדיב
        // <div>
        //     <h1>Hello</h1>
        //     <Div></Div>
        // </div>
        // דיב מגביל אותנו כיון שיש לו הגדרות...

        // 2. ריאקט יצרה לנו תגית ריקה - שאין לה שום הגדרות ולא תופסת מקום
        // <React.Fragment>
        //     <h1>Hello</h1>
        //     <Div></Div>
        // </React.Fragment>

        // 3. ריאקט מאפשרת לנו לא לכתוב כלום בתוך התגית 
        //  והיא תטען אוטומטית את הקומופננטה הריקה
        <>
            <h1>Hello</h1>
            <Div></Div>
        </>
    )
}